[
	{
		"id": 1,
		"version": "0.8.0",
		"title": "Welcome to LOOT.io Closed Beta!",
		"excerpt": "We are so excited to be able to share our game with you! We wanted to quickly showcase what to expect during the Closed Beta.",
		"body": "**Welcome to LOOT.io Closed Beta!**\n\nWe are so excited to be able to share our game with you! We wanted to quickly showcase what to expect during the Closed Beta.\n\n+ **Explore** a mysterious world.\n+ Defeat monstrous enemies.\n+ Collect **rare loot**!\n+ Visit an **Outpost** to send your loot back to town.\n+ Die and repeat!\n\nHead back to town and equip weapons, augments, and gear to **completely** customize your playstyle. If you're happy with what you have equipped, then put newfound loot in the **Smelting Furnaces** to earn coins or list your best items on the **Marketplace** to sell to other players.\n\nThe game you are about to play is **not the final version**, but a solid representation of what the game will be, and what we are aiming for. We are still actively developing to craft the best experience for players, and we will act swiftly to resolve issues and improve the game based on feedback.\n\nPlease **share your thoughts** on [Discord](https://discord.gg/jffWpwAvfs). We would love to hear your thoughts, opinions, concerns, and compliments!\n\nThanks again for signing up and happy looting!\n\nTips\n\n+ For the best experience, please use a mouse for shooting and aiming. It's much easier than a touchpad.\n+ In the Adventure World, use the **Compass** (top right corner) to quickly find locations in-game.\n+ In the Hub World (town), use the **Main Menu** (top right corner) to quickly access different vendors and stations to save yourself the walk.\n+ The tutorial in the Hub World only directs you to 3 locations, but feel free to explore everything!\n+ Want to change your character's look? Open the **Player Profile** from the main menu and select 'Change Skin'. Many different looks to choose from!\n+ Though the game will work on all browsers, we recommend Chrome if you have a choice.\n\nKnown Issues\n\n+ When a run is ended voluntarily, the death animation will play. This is strictly visual and does not impact any loot returning. \n+ Occasionally the game will display a white screen, due to a WebGL or 'Out of memory' crash. You can refresh the page to bypass this issue.\n+ There may be delays between input and in game actions, most notable during times of high player/enemy count during combat.\n+ Compass' 'POI' option will only point to one POI location in biomes that have 2.\n+ Weapon PFX (such as a charge up or a beam) can be offset from the weapon when moving around.\n+ Slight delay when posting or purchasing an item from the Marketplace, along with collecting coins from the Furnace.\n+ Rarity filter on the Augment screen can be changed during the tutorial causing a soft block.  If this happens, just clear the filter to be able to perform the appropriate action.\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 2,
		"version": "0.8.0",
		"title": "Patch 0.8.0 Beta Launch",
		"excerpt": "This is our FIRST patch during closed beta, so we wanted to showcase some of our most important additions!",
		"body": "**Patch 0.8.0 - Closed Beta!**\n\nWe are so excited to be able to share our game with you! This is our FIRST patch during closed beta, so we wanted to showcase what you can expect!\n\n+ **Explore** a mysterious world.\n+ Defeat monstrous enemies.\n+ Collect **rare loot**!\n+ Visit an **Outpost's Worm Mail** to send your loot back to town.\n+ Die and repeat!\n\nVisit the **Terila Forest** to find spooky Wisps, angry Goblins, and the occasional Stranglevine blasting you with its stationary attack.\n\nTake on the fearsome? **B.F.C.** in the Saffron Beach to advance past the looming, purple mists and venture deeper into the island.\n\n+ Added 6 new weapon types:\n  + **Spellswords** - Cut your enemies down with a sizzling beam\n  + **Crossbow** - Charge up to launch a long-range shot with pinpoint accuracy\n  + **Wands** - Blast enemies with rapid-fire projectiles\n  + **Scythes** - Mow through enemies with short-range, wide-angle shots\n  + **Staves** - Unleash explosive shots, and charge up to make them bigger\n  + **Arcane Focus** - Your esoteric and elemental projectiles will spell doom\n\n+ Added over 25 new weapon augments:\n  + **3 Piece Shoot** - Adds 2 extra projectiles to every shot (that's 3 total!)\n  + **Explosive** - Causes your projectiles to explode, dealing area damage.\n  + **Flamethrower** - Burning. Lots of burning.\n  + And many more!\n\n+ Added 9 new types of gear, each with a skill:\n  + **Tumble Roll** - Quickly roll out of the way of attacks, and fire faster for a very short time.\n  + **Battle Cry** - Raise the morale of all players near, boosting attack rate and damage.\n  + **Overshield** - Overcharge your shields, granting bonus shields and much faster shield regeneration.\n  + And many more!\n\n+ Added numerous places to visit in town, be sure to check out the:\n  + **Smelting Furnace** - To smelt unwanted items down and earn coins.\n  + **Worm Mail** - To get ALL that loot you sent back during your run.\n  + **Stash** - To equip new weapons, gear, and augment your items.\n    + Remember: During each run, your loadout is locked! Make sure you choose the right tools for the job!\n  + And don't forget to change your **player skin** under the Player Profile!\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 3,
		"version": "0.8.1",
		"title": "Patch 0.8.1 Closed Beta",
		"excerpt": "Bug fixes, performance improvements, quality-of-life, and loads of balance changes!",
		"body": "**Patch 0.8.1 - Closed Beta**\n\nWe are pumped to bring you a **big** patch only 4 days after launch! We had three primary areas of focus for this patch:\n\n:bug: **Bug Fixes**, improving stability, and improving performance\n:computer: **Quality-of-Life** and UI improvements\n:wrench: **Game Balance** for adventures, augments, and weapons\n\n:bug: **Bug Fixes**\n\nWe've worked hard on improving performance and reducing memory issues - this is a **work in progress** that we'll continue focusing on throughout all phases of the beta!\n\n+ We made a lot of progress on the **dreaded :white_large_square: white screen crash** - you should see it much less often.\n+ Improved some performance issues with lots of items in the Hub World.\n+ Fixed a bug where players could be headless.\n+ Fixed a bug where players could freeze when entering a new world.\n+ Fixed many bugs where players could sneak through terrain, including around (most) boss arenas.\n+ Fixed a bug where the Boss Wisp NPC would think you were on the wrong side of the arena.\n+ Fixed a bug where the Mirrored Dragon would be occasionally invulnerable.\n+ Fixed Mirrored Dragon's spawned Sliver minions moving through walls.\n+ Fixed a bug where augments would always show 'Glacial' as their projectile speed modifier.\n+ Fixed a few tooltip/details bugs with Weapons & Augments.\n+ Fixed a bug where Icebound Augmented weapons could produce projectiles of truly ridiculous size, that would clip terrain in awkward ways.\n\n:computer: **Quality-of-Life**\n\n+ LOOT is now sorted from highest level to lowest on most screens.\n+ Added **Search** for the Stash and other panels, searching any text will show any items that match in the name, for example: `3 piece` will show you all your 3 Piece Shoot Augments. :uncommon:\n+ Equip/Attach tooltips should better explain why you cannot Equip or Attach something (too low level, incompatible augment+weapon, etc.)\n+ Added a 'Skip Tutorial' button in Settings\n\n\n:wrench: **Game Balance**\n\nWe expect that game balance could be wildly in flux throughout closed beta, because no team can get this right without a wonderful group of players to help demonstrate and break it!\n\n**Please bear with us as we make frequent minor and major adjustments through the entirity of beta.**\n\n+ The number of Augment Slots on a Weapon now scales up with **rarity** :legendary:, meaning that higher rarity items will **more often** spawn with more slots - but not always!\n+ Changed the slot limit for different levels of weapons:\n    + Level 1: 2 slots\n    + Level 16: 3 slots\n    + Level 31: 4 slots\n    + Level 61: 5 slots\n    + Level 91: 6 slots\n\n+ Majorly buffed many augments, anywhere from 5-40% increased damage:\n    + **Cluster Shot** (less damage penalty)\n    + **Debilitator** (+flat damage, -% damage)\n    + **Icebound** (+damage)\n    + **Pierce** (less damage penalty)\n    + **Rapid Fire** (+damage)\n    + **Sniper** (+damage, +range)\n    + **Taser** (+damage)\n    + **Tighten Spread** (+damage)\n\n+ Buffed a couple Enchantments, and nerfed one:\n    + **Extra Projectiles** (less damage penalty)\n    + **Big Bad Beam** (+damage)\n    + **Overcharged Shot** (-damage) - We intend to make this only work with Charge weapons in a future patch.\n\n+ Also nerfed many augments, usually around 13-5% decreased damage, but a few were *very* out-of-line:\n    + **Slowshooty** - This augment was WILDLY powerful and has been brought down a significant amount\n    + **Creeping Death** (-damage)\n    + **Diffusion Beam/Focused Beam/Star Laser** (-damage)\n    + **Flamethrower** (-damage)\n    + **Quick Charge** - Another massive DPS increase that was brought more in-line\n    + **Stat Up+** (-damage at higher levels, same at lower levels)\n\n+ Some Augments were able to be used on weapons they weren't intended for, here are some changes to augment restrictions:\n    + **Lightning Burst** - No longer usable on Spellswords\n    + **Boomerang** - No longer usable on Crossbows\n    + **Flamethrower, Rapid Fire, Slowshooty** - No longer usable on Crossbows/Staves\n\n+ Charge-up weapons don't make significant use of Attack Rate, so augments that adjust Attack Rate shouldn't benefit them\n\n+ Changed the damage multiplier for a full charge on charge-up weapons, from 250% for **Crossbows and Staves** to 200% for Staves and 225% for Crossbows\n+ Slightly reduced the charge rate of high level (30+) **Crossbows and Staves**\n+ Capped Splash Damage at 100%\n+ Dreamers now skillfully fight back! Sorry @Rustery!",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 4,
		"version": "0.8.2",
		"title": "Patch 0.8.2 Closed Beta",
		"excerpt": "Smelting Furnace improvements, bug fixes and more!",
		"body": "**Patch 0.8.2 - Closed Beta**\n\n@Beta Our patch for this week focuses on cleaning up some rough edges and a lot of bug fixes. The **Smelting Furnace Improvements** are a key highlight, and will let you collect coins at **any** time, even if smelting hasn’t finished. We’ve also made a lot of improvements to Hub World performance, especially if you’ve collected a mountain of items.\n\nRead on below!\n\n:computer: **Quality-of-Life**\n\n*   Furnace Improvements! You can now collect all the coins you’ve smelted so far, at any time! No more long waits without coins.\n*   Substantially improved Hub World server performance, especially when players in the Hub have loads of items.\n    * We do intend to add Stash Limits (upgradable) in a future patch, to keep stashes reasonable.\n*   Added a notification to both the Login and Hub World when new **Game News** is posted.\n\n:wrench: **Game Balance**\n\n*   The Mirrored Dragon arena has been adjusted to feel less cramped and support better tactics.\n*   Bosses with large arenas should behave and **aggro** more consistently.\n*   Fixed a bug where Mirrored Dragon would be a total **derp** in the corners of the arena.\n\n:bug: **Bug Fixes**\n\n*   Removed the Item Search from several screens where it was unnecessary.\n*   Performance improvements when moving items between different stations in the Hub World.\n*   You can no longer attempt to list an item on the Marketplace if you cannot afford the listing fee.\n*   The character preview in the ‘Change Skin’ screen now updates properly.\n*   The ‘Trash your inventory?’ prompt after sending a worm now shows up after each worm, as intended.\n*   You can no longer accidentally close video ads by pressing certain hotkeys.\n*   The Compass UI now properly updates when you send a worm in your furthest unlocked Outpost.\n*   Fixed a bug where ‘Critical!’ hit messages would stick around.",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 5,
		"version": "0.8.3",
		"title": "Patch 0.8.3 Closed Beta",
		"excerpt": "Special Modifiers, Augment Reworks, and new item mods!",
		"body": "**Patch 0.8.3 - Closed Beta**\n\nWelcome to Patch 0.8.3! This week we're adding 'NEW!' badges to newly looted items, reworking a bunch of Augments, adding new Special Modifiers to add some fun gameplay to our item system, and much more!\n\n:computer: **Quality-of-Life**\n\n+ Newly looted items will display 'NEW!' for easier sorting :smile:\n+ The Inventory in the Adventure World is now sorted by rarity, and then level\n    + This should make it easier to toss low priority items\n\n:bug: **Bugs**\n\n+ Made it so that boss ground target AoE attacks will not land outside the boss arena\n+  Bosses now reset their health if their arena is empty of players! No more slowly chipping away at them :cheese:\n+ Fixed an issue where the prism boss could be stuck in a bad state if players die during the cocoon phase \n\n:wrench: **Game Balance**\n\n**Special Modifiers**\nAs teased here: [Loot.io Discord Channel](https://discordapp.com/channels/763129740890472468/831927134980800573/854498953130672139)\n\nWe're adding a new 'Special Modifiers' section on items. These modifiers aren't just stats, but can provide a wide range of benefits:\n+ Adding 'chance to proc', like 'on hit' or 'on kill' bonuses\n+ 'Unique' bonuses - could be anything!\n+ Converting stats from one kind to another\n+ Much more!\n\n**:heart: Improved Healing Hearts**\nWe wanted hearts to feel more impactful, so we doubled the healing on each heart, but reduced how many drop.\n\n---\n\n**:legendary: Augments**\n**Elemental Damage Conversion**\nEach of these Augments now convert some of your physical damage to elemental damage: **Flamethrower**, **Icebound**, **Taser**, **Debilitator**, **Lightning Burst**. More special modifiers!\n\n+ **Flamethrower Augment**: No longer has a projectile penalty, but instead converts extra projectiles to attack rate.\n+ **Icebound Augment**: No longer has a projectile penalty, but instead converts extra projectiles to bonus size and damage.\n+ **Debilitator:** Attack rate bonus reduced from x1.25~ to x1.1~\n+ Added new augment mystery mods: ?????\n\n**Augment Attack Rate Change**\nAugments have had an unintended, extremely high attack rate mod available at higher tiers (up to x2.9 or higher). This mod actually leads to server performance issues, especially if players are running 5-6 copies of mods with these attack rate boosts. While we do apply diminishing returns to attack rate above a certain point, it wasn't enough to prevent players from being able to create enough projectiles to lag out the server (and each other!)\n\nThis Attack Rate mod has been rescaled to provide up to **x1.98 attack rate**, and now has tiers available up through level 99 (previously capped at level 75).\n\nHowever, we're making Augments **much** more interesting with new and improved mods to chase! :eyes: Inspect your new Augment drops carefully!\n\n---\n\n**:magic_wand: Weapons **\n+ Slightly reduced the range and projectile speed on Arcane Focus\n+ Added new weapon mods: **crit chance** and **crit damage**\n\n**Mini Wand Rework**\nWands used to have a x0.5 projectile penalty. This was replaced with a 'Maximum of 3 proj. count' penalty, allowing wands to more easily benefit from a couple extra projectiles. (btw, this is a special modifier!)\n\nPew pew!\n\n---\n\n**:gearpendant: Gear  **\n+ **Overshield**: Max shields reduced from 4 to 3; duration reduced by 20%~; multiple uses of Overshield now only recover 3 missing shields, not ALL shields.\n\n**New Gear Mods**\nWe added several 'Special Modifiers' for gear that provide some unique bonuses. Find them!\n\n**Misc.**\n+ Rebalanced the level that certain mods start appearing on weapons, augments, and gear\n    + Movement speed\n    + Max shields\n    + Splash radius/damage\n    + Pierce\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 6,
		"version": "0.8.4",
		"title": "Patch 0.8.4 Closed Beta",
		"excerpt": "Faster load times, less memory usage, and quality-of-life!",
		"body": "**Patch 0.8.4 - Closed Beta**\n\nWelcome to Patch 0.8.4.\n\n:computer: **Quality-of-Life**\n\n+ Several screens in the Hub World now have hotkeys:\n    [U] for Furnace\n    [L] for Worm Delivery\n    [M] for Marketplace\n    [B] for Departure\n+ We gave the Identification NPC some quality-of-life by sprucing up his runestone abode\n\n:bug: **Bugs**\n\n+ Fixed some **major** and minor memory leaks!\n+ Optimized asset loading, so more assets are loaded on-demand instead of up-front\n+ Fixed a bug when purchasing items at Bubba's Store or the General Store that could result in a double-purchase\n+ Fixed an issue where the timer for Marketplace listings didn't match what you had selected\n+ Your coin balance now updates when you check the Marketplace\n+ Your stash now updates if you check the Marketplace and find a listing has expired\n+ Fixed an issue where resizing the browser window could cause enemies and props to 'pop in' on the edges of the screen\n\n:rare: **Game Balance**\n\n+ Rarity Shards now come in additional rarities. How they alter the Trash Pit of Chances is anyone's guess, but enjoy these new :rarityshardlegendary: and :rarityshardastro: shards!\n+ The awesomeness of Weapon visuals is now based on the rarity of the weapons - no more Astronomical Twigs!\n+ The weapon testing range now has more animations - step one toward target dummies! :no_mouth:",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 7,
		"version": "0.8.5",
		"title": "Patch 0.8.5 Closed Beta",
		"excerpt": "New leaderboards, faster POIs, and more bug slayin'!",
		"body": "**Patch 0.8.5 - Closed Beta**\n\nWelcome to Patch 0.8.5.\n\n:ice_cube: **Cool New Stuff**\n\n+ We added a ton of new leaderboards!\n  + Items Looted\n  + Worm Items Deposited\n  + Points of Interest Defeated\n  + Enchantments Equipped\n  + Max Critical Strike Damage\n\nWho's going to land the **biggest hit** of them all?!\n\n:computer: **Quality-of-Life**\n\n+ 'Monster Raid' Points of Interest will now spawn the next wave after most of the previous wave is defeated, instead of after a set delay of time. Faster completion!\n\n:bug: **Bugs**\n\n+ Fixed a bug where pressing Tab could have unintended effects, including disabling your controls and opening weird screens\n+ Fixed a bug with Spellswords could fire through some walls\n+ Fixed a bug where enemies outside of Boss Arena could attack you if you were inside\n+ Continued slaying 'white screen of death' and memory leak bugs!",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 8,
		"version": "0.8.6",
		"title": "Patch 0.8.6 Closed Beta",
		"excerpt": "PETS! GEAR! Training Dummies and Death Recap!",
		"body": "**Patch 0.8.6 - Closed Beta**\n\nWelcome to Patch 0.8.6.\n\n:ice_cube: **Cool New Stuff**\n\n**:cat::dog: PETS!** Hunt for a rare pet egg and hatch it to have a lil' buddy join you on your adventure! There are dozens of pets to hunt for, like the gorgeous **Spotted Tabby**, the regal **Border Collie**, or the infamous **Narwhal**. What can you can catch?!\n\n:computer: **Quality-of-Life**\n\n+ Added training dummies to the hub! Get a feel for your new augment combo before trying it on a real adventure\n+ Players now spawn at slightly different locations as part of our social distancing protocol\n+ As QOL for Bubba, he now has a hut in the Hub World instead of standing on the streetcorner\n\n\n:bug: **Bugs**\n\n+ Weapon cards with lots of Augment slots will no longer stretch out to the ends of the known universe\n\n:rare: **Game Balance**\n\n+ The cost of Shop Buffs and Healing now scales with your progression level\n\n**:gearpendant: Gear **\n\n**:shield: Time to Armor Up!** Gear now drops with a wide variety of possible stats that increase your max health or armor. These stats can make your life far easier against the enemies who are dealing particular types of damage. Try out various armor combos in the different biomes and against the bosses to figure out what keeps you alive the longest! Be sure to keep your gear up to date with your current tier, or else the monsters will leave your armor in the dust.\n\nThe paperdoll will now show you exactly how effective your defenses are in the current biome, so you can use that as a reference when equipping lots of Poison Resist in order to properly defeat The Rotfather. :D\n\nIn addition, we've added a Death Recap to the death screen, to show you exactly what kinds of damage you took over the course of your entire run, so you can prepare accordingly!\n\nBe on the lookout for new pieces of Gear :gearbelt: with new defensive stats and capabilities!\n\n**:crabwhat: Enemies**\n\n+ Related to the defensive changes, the way enemy damage scales with world tier has been increased at higher world tiers.\n+ Prism Dragon will now heal more *consistently* during encounters - instead of healing too often on some fights, and never on other fights\n+ Prism Dragon will no longer spam invulnerability phases (sky raid, cocoon) repeatedly, giving you more chances to pelt the Dragon mercilessly",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 9,
		"version": "0.9.0",
		"title": "Patch 0.9.0 Closed Beta",
		"excerpt": "Party with up to 6 friends!",
		"body": "**Patch 0.9.0 - Closed Beta**\n\nWelcome to Patch 0.9.0.\n\n:ice_cube: **Cool New Stuff**\n\n**:partying_face:  Party System**\n\nParty up with your friends and adventure together! Open the Party menu in town (via the main menu or the `G` key) and create a party with up to 6 total players. When adventuring as a party, you'll easily be able to find your other party members in the Adventure, and make sure they're not taking a beatdown!\n\n<party play gif/video here?>\n\n**:medical_symbol: Resurrection Altars**\n\nBeing a corpse is such a bummer - so we *completely changed it!* Now when you die you'll become a :ghost: **ghost**. You can be **revived** at a powerful **Resurrection Altar** and carry on your run - losing your items, but keeping your enchantments and your party together!\n\n<resurrection video here?>\n\n**:cyclone: New Difficulty Mechanic: Soul Cycles**\n\nA massive overhaul to the game's progression, we're introducing **Soul Cycles**. After beating the game on Medium, you'll be able to customize future runs by selecting **Soul Bonds** that make your run more challenging. The higher you stack up your Soul Bonds, the harder the challenge - and the better the loot!\n\n<soul cycle screenshot here?>\n\n**:crossed_swords: Cross-Level Play**\n\nUsing the new Soul Cycle difficulty system, players of **all** different levels can play together. Are you level 150 and want to play with your level 10 friend? No problem, party up, and adventure onward!\n\n**:dizzy: Weapon Trajectories**\n\nWeapons can now spawn with wild new trajectories! Shots that can orbit you, travel in a wave, or accelerate quickly are some of the new things to discover!\n\n**:hourglass: World Difficulty**\n\nIn addition to Soul Cycles, players can join different worlds with increasing difficulty. Enemies get smarter with craftier AI, but higher quality loot drops more often.\n\n**:calendar: Daily Login Bonuses**\n\nNow you'll receive daily login rewards, with major rewards every few days. Be sure to check in and claim your rewards!\n\n**:dog: Pets**\n\nHunt for a rare pet egg and hatch it to have a lil' buddy join you on your adventure! There are dozens of pets to hunt for, like the gorgeous **Spotted Tabby**, the regal **Border Collie**, or the infamous **Narwhal**. What can you can catch?!\n(we added this *right* at the end of beta1, but it's worth mentioning again!)\n\n\n:computer: **Quality-of-Life**\n\n+ Added better Stash and Augment filtering\n+ Added more hotkeys for many screens in the Hub World\n+ Improved the 'End of Run' screens to add damage recaps (for all runs) and info about what you unlocked (for successful runs)\n+ Improved load times!\n\n**:magic_wand: Weapons**\n\n+ Added tons of new weapon trajectories, like:\n  + Orbit\n  + Circular\n  + Sine-wave\n  + Zig-zag\n  + Accelerator (reworked)\n  + Decellerator (reworked)\n+ Added tons of new weapon art\n+ Spellswords have been revamped with improved Ailment potential and a stacking damage boost on-hit\n+ Scythes have been revamped with Double Tap, a new special modifier allowing you to shoot twice in quick succession\n\n**:legendary: Augments & Enchantments**\n\n+ Added 1 new augment\n+ Added 2 new enchantments\n+ Rebalanced all enchantments\n\n**:gearpendant: Gear **\n\n+ Added 3 new gear skills\n+ New art for viewing Gear in a slide-out panel!\n+ Player elemental resistances in the paperdoll now shows easier-to-read values\n\n**:map: World**\n\n+ Made the world a bit bigger!\n+ Added Ressurrection Altars to every biome\n\n**:crabwhat: Enemies**\n\n+ Enemies now spawn in packs, occasionally with a champion leading the charge!\n+ Players now need to deal a bit more damage to 'tag' enemies and bosses and receive kill/loot credit\n\n:rare: **Game Balance**\n\n+ Rebalanced the game's progression to support Soul Cycles\n+ Rebalanced enemies & bosses for party play\n+ Retuned drop rates of items, especially for higher-end rarities\n+ New item: Worm Horn! When you die, you can consume the horn to call a baby worm that will save an item or two!\n+ Players now have stash, pit, and worm limits. This will help cut down on server lag as well\n\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 10,
		"version": "0.9.1",
		"title": "Patch 0.9.1 Closed Beta",
		"excerpt": "Daily Login Rewards & Smarter Enchantments!",
		"body": "**Patch 0.9.1 - Closed Beta**\n\nWelcome to Patch 0.9.1.\n\n:ice_cube: **Cool New Stuff**\n\n+ Daily rewards are now enabled and working!\n\n:computer: **Quality-of-Life**\n\n+ You can now filter the Stash for all kinds of cosmetics, not just Pet Eggs\n+ Small improvements to the Smelting Furnace, and Inventory UIs\n\n:rare: **Game Balance**\n\n+ **Worm Mail Expiry** - When items get delivered through Worm Mail, they have a 36 hour timer before they expire. Make sure you Stash anything you want to keep, and Trash the rest!\n\n**:enchantment: Enchantments**\n\n+ Enchantment rewards are now Smart Rolled, using logic to see if the Enchantment could be appropriate for one of your weapons. This means you shouldn't get an Ice enchantment if your build isn't focused around Ice damage\n\n**:map: World**\n\n+ Packs with 3 champions will no longer spawn in Easy difficulty\n\n**:crabwhat: Enemies**\n\n**B.F.C.**\n+ Now has a bit less health\n+ Crab Block now reduces damage from all damage types, not just physical\n\n**Fearie Queen**\n+ Now has a bit less health\n+ Shard Volley attack is less erratic and easier to dodge\n\n**Rotfather**\n+ Now has significantly less health\n\n**Mirrored Dragon**\n+ Now has significantly less health\n+ Attacks are generally less threatening on Easy difficulty\n+ Crystal Breath attack is less erratic and easier to dodge\n\n:bug: **Bugs**\n\n+ Daily rewards are now enabled and working!\n+ Fixed several bugs where the Party UI wouldn't update\n+ Fixed a bug where alt-tabbing could occasionally disable movement or cause other strange issues\n+ We are continuing to work on server performance, and have made improvements to both Hub and Adventure servers.\n+ Fixed a bug where Double Tap caused weird things to happen when weapon switching\n+ Fixed a bug where players could get extra Enchantments beyond their unlocked slots\n+ Fixed a bug where Critical Hits only affected Physical damage\n+ Fixed a bug where the No Finesse enchantment was actually giving a Critical Strikes enchantment\n+ Fixed a bug where the Weak Point soul bond was backwards\n+ Enemy health no longer scales with nearby ghosts\n+ Fixin' crash bugs!\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 10,
		"version": "1.0.0",
		"title": "Patch 1.0.0 Early Access",
		"excerpt": "WE'RE LIVE!!",
		"body": "**Patch 1.0.0 - Early Access Launch!**\n\nWelcome to Patch 1.0.0, our Early Access launch! We are excited you are joining us! \n\nWe will be opening the Adventure servers two times a week on **Tuesdays** from 9 AM EST through 9 PM EST, and on **Fridays** from Noon EST through midnight EST. Add us to your :calendar: !\n\n:ice_cube: **Cool New Stuff**\n\n+ **Enemies now drop coins!** Be sure to send them back through the Worm Mail :wormmail: to make them available! \n+ **Pit of Chances now awards coins!** Up to a limit each day. Make sure you fill up the Pit daily!\n+ Added an **Auto Augment** button to quickly select some decent augments for your weapon! In a rush? Just use Auto! (Note: this is not designed to min/max the best possible combo, just a good one)\n+ **Experimental netcode overhaul** - Enable 'Movement Prediction' in the settings to have snappier movement and shooting. This feature is experimental and has bugs!\n\n\n:computer: **Quality-of-Life**\n\n+ Many consumable items are now **stackable**, like Biome Keys and Shards\n+ **Speech bubbles** will appear above people's heads when they are chatting\n+ Send your **party invites in chat** with the press of a button! And join by clicking the link!\n+ There are timers at the top of the screen in town to show you how long the Adventure servers are open, or if they are closed, when they will open again.\n+ Added a ping counter in the top-right corner of the screen\n+ Improved the Marketplace, Stash and Augment screens with some minor UX tweaks\n+ Made more room for bigger numbers in lots of areas on the UI\n+ Players can **expand their stash space** permanently in the Premium Shop\n+ Added **Professor Wisp**, a helpful wisp that will explain certain mechanics in-game\n\n:bug: **Bugs**\n\n+ Over 200 bugs were harmed in the making of this release!\n\n:enchantment: **Art**\n\nWe've worked extremely hard to create a slew of different looks and fashionable accessories for your characters to use. We've added a lot of new cosmetic categories with some gorgeous art. Many of these are available for either Coins or Prism Scales in the Premium Shop. Check it out!\n\n+ New cosmetic category: **Back Attachments** - Wings, weapons, fancy a paintbrush? It's all here.\n+ New cosmetic category: **Face Attachments** - Sunglasses, masks, snorkelling gear? You name it.\n+ New cosmetic category: **Trails** - These beautiful trails leave awesome footsteps, visual effects, or even allow you to nyaaaan your way across the world.\n+ New cosmetic category: **Weapon Skins** - These reusable weapon skins can override the appearance of any weapon with a matching type (crossbow, spellsword, etc.)\n\n:rare: **Game Balance**\n\n+ **Normal Difficulty Rebalance** - The game has been rebalanced on Normal difficulty to make it easier to get into, and less frustrating.\n+ Splash damage & radius have been retuned to make low investment in Splash more impactful\n+ New ailment: **BLEED**. Stacking up bleed on targets can trigger a **Bleedsplosion**, dealing AOE damage around the target\n+ Improvements to **Soul Cycles** and the **Soul Bond** modifiers - you'll now unlock more Soul Bonds with every cycle you complete\n+ New buffs are available for purchase in the Outposts in-game\n+ Tweaks to Lucky Boon's effects\n+ Added new Special Modifiers to find on items!\n\n**:legendary: Augments**\n\nMany Augments and Enchantments from beta have received changes or overhauls. Beta players, check the tooltips closely!\n\n:enchantment: **Enchantments**\n\n+ In beta2 we made it so that Enchantment rewards are now Smart Rolled, using logic to see if the Enchantment could be appropriate for one of your weapons. This means you shouldn't get an Ice enchantment if your build isn't focused around Ice damage\n+ Added several new Enchantments\n\n**:crabwhat: Enemies**\n\n+ **Boss Rebalance** - All bosses have been rebalanced on all difficulties, with mechanics made much easier on Normal difficulty\n+ Added better 'tells' to many boss attacks, to warn players of what is happening. Keep an :eye: out!\n",
		"iconBackground": "none",
		"icon": "loot-news"
	},
	{
		"id": 11,
		"version": "1.0.1",
		"title": "Patch 1.0.1 Early Access",
		"excerpt": "First Run Bonuses, Quality-of-Life, and a more packed Adventure World!",
		"body": "Patch 1.0.1**\n\nWelcome to Patch 1.0.1.\n\n:ice_cube: **Cool New Stuff**\n\n+ New 'First Runs' bonus! Champions and Bosses should now always drop coins on your first few runs of the day\n+ **Harder world difficulties** now provide a **loot bonus**, yielding more and better loot on harder worlds!\n\n:computer: **Quality-of-Life**\n\n+ :epic: Augmenting:\n     + Augments that are equipped on your Weapons will now be shown in the Augment list when you remove them (hooray!)\n     + Closing the 'Advanced Filters' panel will now clear those filters\n+ Improved party messages that are displayed when you end a run\n+ Added better messages on **when the server is open/closed** due to the **Storm** :thunder_cloud_rain: \n\n:bug: **Bugs**\n\n+ You can no longer aggro B.F.C. :crab: from outside the arena\n+ Rotfather will no longer spawn Blimpies outside the arena\n+ Mirrored Dragon will no longer get stuck in her Crystal Cocoon\n+ POIs that are respawning should now display the correct time when you first enter them\n‌‌ \n:rare: **Game Balance**\n\n> :thought_balloon: We are **very aware** of issues with game balance, especially around Soul Cycle 3 through endgame. We are currently hard at work in the lab, working on improving the pacing and reducing the grind of this endgame content. It'll take a few more weeks before we have a first cut ready, but we're eager to continue improving the gameplay & balance experience for our veteran players!\n\n> Until then, we have some tasty improvements that should enhance many kinds of underperforming weapons:\n\n+ Projectiles with **splash damage will ALWAYS explode**, even when striking terrain or at max range\n+ Projectiles that **orbit/circle** around players can now **strike enemies multiple times**, dealing bonus damage, also improved the motion on these trajectories\n\n> :thought_balloon: A small note on coin drops - currently coins are overflowing our pockets as if we've got Midas' touch. We want to tone down the total amount of coins being introduced, while making Smelting Furnaces *slightly* more rewarding to use - since it's fun to collect that big chunk of coins each day.\n\n> In our next content update, we're adding more awesome stuff you can buy with your coins, but until then we're making these small balance tweaks to improve the coin economy:\n\n+ Enemy coins drops have been slightly reduced \n+ Champion coin drops have been increased a ton\n+ Pit of Chances coin rewards have been slightly reduced\n+ Coin costs of all Shop items have been rebalanced\n+ Identification costs have been rebalanced\n\n**:gearpendant: Gear **\n\n + Battery: This skill has been reworked so you can toggle it on and off, similar to a 'siege mode' or 'turret mode' mechanic in other games\n‌‌ \n**:map: World**\n\n+ Several POIs have been rebalanced: Lighthouse, Death Dealers, Ack, Shriekers!, Gathering of Wisps, and Resurrection Altars\n+ Increased the size of the Sunset Prism Cliffs to better match other biomes\n\n**:crabwhat: Enemies**\n\n+ Top secret **variant enemies** spawn throughout the world and yield **enhanced loot** compared to their counterparts\n    🎩\n    🦀 \n+ Champion enemies now once again spawn throughout the world, not just at POIs!\n+ Champions movement speed bonus has been reduced from 20 -> 15%\n+ Mirrored Dragon:\n   + Crystal Cocoon (the healing ability) has had its cooldown increased from 15 -> 60s, but heals for about 20% more\n   + The Dragon is now briefly stunned after coming out of Crystal Cocoon\n   + The spawn rate of Slivers has been lowered on all difficulties\n+ Improved enemy spawning in areas to distribute enemies more consistently throughout the world\n+ Many enemies have had their drop rates tuned - weaker enemies will drop slightly less loot, while very tanky or **dangerous enemies will drop much more loot**\n",
		"iconBackground": "none",
		"icon": "loot-news"
	}
]
